app/Controllers/User.php

SELECT *
FROM `orang`
WHERE `id` = '252'
 LIMIT 1
---
    public function detail()
    {
        $id = session('id_orang');
        $query = $this->userModel->where('id', $id)->first();